# StairSetTotalRiseM

## Description
Sets total rise of stair - not recommended for use as stair might end up with inconsistent and contradictory parameters.

```pascal
FUNCTION StairSetTotalRiseM(
				stair     : HANDLE;
				TotalRise : REAL): BOOLEAN;
```

```python
def vs.StairSetTotalRiseM(stair, TotalRise):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE|   |
|TotalRise|REAL|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Stairs